// Loop

// ------------------------------------------------------------------------------------
// 1-100 хүртэлх тоонуудын нийлбэрийг ол.

// let a, sum = 0;

// a = 1
// while (a <= 100){
//     console.log(a) // Prints 1, 2, 3 ... 100
//     sum+=a;
//     a++
// }
// console.log(sum) // Prints 5050

// ------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------

// 223 ni anhnii too mun esehiig togtooh program bich

// num hurtelh buh toond huwaaj uzne

// let num = 5;
// let a = 1;
// let count = 0;

// while(a <= num) {
//     if (num % a == 0) {
//         count++;
//     }
//     a++;
// }
// if (count == 2) {
//     console.log('Anhnii too');
// } else {
//     console.log('Anhnii too bish')
// }

// ------------------------------------------------------------------------------------

// Bodlogo 1: 1-1000 hurtelh tegsh toonuudiin niilberiig ol

// let a = 1;
// let sum = 0;

// while (a <= 1000) {
//     if (a % 2 == 0 ) {
//         sum += a
//     } 
//     a ++
// } console.log(sum)

// ------------------------------------------------------------------------------------

// Bodlogo 2 
// a, b тооны ХИЕХ-ийг ол. ХИЕХ гэдэг нь a,b тоог хоёуланг нь хувааж чаддаг хамгийн их тоо юм.
// Жишээ нь
// a=12 b=18 бол хариу 6
// a=16 b=5 бол хариу 1

// let a = 16;
// let b = 12;
// let c;
// let n = 1
// while (n <= a) {
//     if (a % n == 0 && b % n == 0) {
//         c = n;
//     }
//     n ++
// } console.log(c)

// ------------------------------------------------------------------------------------

// Do While Loop

// 100-1 хүртэл хэвлэх програмын алдааг олж зөв болгон ажиллуул.

// let n = 100;
// let i = 1;
// do {
//     console.log(n);
//     n--
// } while (i <= n) {
// }

// ------------------------------------------------------------------------------------

// Бодлого 2
// Доорх код нь ямар утга хэвлэх вэ?

// let x = 0;
// do {
//     console.log(x); // Prints 0
//     x = 1;
// } while (x < 0);
// console.log(x); // Prints 1

// ------------------------------------------------------------------------------------

// For Loop - 3 uildelee zereg uurtuu hiih chadaltai

// for (let i = 0; i < 10; i = i + 1) {
//     console.log('toirson')
// }

// ------------------------------------------------------------------------------------

// Бодлого 1
// Дараах кодыг өөрчлөн 0-10 биш 10-0 хүртэл тоог хэвлэдэг болго.

// for(i = 0; i < 10; i++) {
//     console.log(i);
// } 

// bsn code iig:

// for(i = 10; i >= 0; i--) {
//     console.log(i);
// } 

// ------------------------------------------------------------------------------------

// Бодлого 2
// 1 - 100 хүртэлх тоонуудын нийлбэрийг ол.

// sum = 0;
// for(let a = 1; a <= 100; a++){
//     sum+=a;
// } 
// console.log(sum);

// ------------------------------------------------------------------------------------

// Any loop - hussen dawtaltaa ashiglan bodlogiig guitsetgene

// Бодлого 1
// N тооны бүх хуваагчдыг ол.
// Жишээ n тоо  (220, 113, 78)

// let n = 25; // hereglegchees awsn too
// let a = 2; // huwaagch
// let b = 0; // huwaagdah bolomjtoi toonuudiig hadgalah huwisagch

// while(a <= n) {
//     if(n % a == 0) {
//         console.log(a)
//         a ++
//     } else {
//         a ++
//     }
// } 

// ------------------------------------------------------------------------------------

// Бодлого 2
// Өгөгдсөн тоо палиндром эсэхийг шалга. Хэрэв мөн бол тийм гэж хэвлэ, үгүй бол үгүй гэж хэвлэ. 
// Палиндром тоо гэдэг нь урдаасаа ч хойноосоо ч бичсэн ижил тоог хэлнэ. 
// Жишээ 1: 
// Input: 1221 Output: тийм 
// Жишээ 2: 
// Input: 133 Output: үгүй

// ? Hiij chadsangui yaj toonuudig salgaj shalghiig meddgue

// ------------------------------------------------------------------------------------

// Бодлого 3
// 3 + 6 + 9 + … + 999 хүртэлх тоонуудын нийлбэрийг ол

// for(let a = 3, sum; a < 1000; a += 3) {
//     console.log(a)
// }

// ------------------------------------------------------------------------------------

// Бодлого 4
// 3-37 хүртэлх тоонуудаас 5д хуваагддаг тоонуудыг хэвлэ.
// Бодлого 5

// let s = 3;
// let t = 0;

// while(s <= 37) {
//     s % 5 == 0
//     t = t + s
//     s ++
//     console.log(t)
// }

// ------------------------------------------------------------------------------------

// Өгөгдсөн тооны цифрүүдийн нийлбэрийг олно уу.
// Жишээ 1: 
// Input: 4019 
// Output: 4 + 0 + 1 + 9 = 14 
// Жишээ 2: 
// Input: 123 
// Output: 1+2+3 = 6

// let a = 4019;

// Shunujin suugad turshij2 uzsn ch ystoi barsngue sry

// ------------------------------------------------------------------------------------

// Бодлого 6
// 	Өгөгдсөн тооны хүрдийг дараах хэлбэрээр гарга.
// 	Input : 3 
// 	Output: 
// 		3*1=3
// 		3*2=6
// 		3*3=9
// 		……
// 		3*10=30

// for (let a = 3; a < 38; a ++){
//     if (a % 5 == 0){
// console.log(a)
//     }
// }

// ------------------------------------------------------------------------------------

// Nested Loop

// ------------------------------------------------------------------------------------

// Бодлого 1 - Дөрвөлжин 1
// * * * * * 
// * * * * * 
// * * * * * 
// * * * * * 
// * * * * *

// let o = 0;
// for (o; o < 5; o++) {
//     for (let j = 0; j < 5; j++) {
//     }
//     console.log('* * * * *');
// }

// ------------------------------------------------------------------------------------

// Бодлого 2 - Дөрвөлжин 2
// * * + * * 
// * * + * * 
// * * + * * 
// * * + * * 
// * * + * *

// let o = 0;
// for (o; o < 5; o++) {
//     for (let j = 0; j < 5; j++) {
//     }
//     console.log('* * + * *');
// }

// ------------------------------------------------------------------------------------

// Бодлого 3 - Дөрвөлжин 3
// 2-оос илүү хувьсагч хэрэглэхгүй.
// * * * * * 
// * * * * * 
// * * + * * 
// * * * * * 
// * * * * *

// Surguuli der mac deer hadglsn bodlogo bga ochood zurgign ywuulnaa

// ------------------------------------------------------------------------------------

// Бодлого 4 - Гурвалжин 1
// * 
// * * 
// * * * 
// * * * *

// for(let i=0; i <= 4; i++) {
//     for(let j = 1; j <= i; j++) {
//         process.stdout.write('* ')
//     }
//     console.log('');
// }

// ------------------------------------------------------------------------------------

// Бодлого 5 - Гурвалжин 2
// * * * * *
//    * * * *
//       * * *
//          * *
//             * 

// for(let i = 0; i < 5; i++) {
//     for(let j = i; j > 0; j--) {
//         process.stdout.write(' ')
//     }
//     for(let j = 5; j > i; j--) {
//         process.stdout.write('*')
//     }
//     console.log('');
// }

// ------------------------------------------------------------------------------------

// Бодлого 6 - Пирамид 1
//           *
//         *  *
//       *  *  *
//     *  *  *  *

// for(let i = 5; i > 0 ; i --) {

//     for (let j = 0; j < i; j++) {
//         process.stdout.write(' ')
//     }
//     for(let j = 5; j > i; j--){
//         process.stdout.write('* ')
//     }
//     console.log('')
// } 

// ------------------------------------------------------------------------------------

// Бодлого 7 - Тоо 1
// 1
// 1 2
// 1 2 3
// 1 2 3 4
// 1 2 3 4 5

// let c='', i=1;
// for (a=1; a<=5; a++){
//     for (b=1; b<=a; b++){
//         c+=i;
//         i+=1
//     }
//     console.log(c)
//     c='';
//     i=1
// }

// ------------------------------------------------------------------------------------

// Бодлого 8 - Тоо 2
// 1 
// 2 3 
// 4 5 6 
// 7 8 9 10

// let c='', i=1;
// for (a=1; a<=4; a++){
//     for (b=1; b<=a; b++){
//         c+=i;
//         i+=1
//     }
//     console.log(c)
//     c='';
// }
